{
  "latest": "0.1.8",
  "versions": [
    {
      "version": "0.1.8",
      "date": "2026-02-15",
      "changes": [
        "ECTS e Área Científica visíveis no Plano de Estudos para cada cadeira.",
        "Novo separador 'ECTS concluídos' no dashboard com contagem total.",
        "Plano de Estudos agora mostra apenas cadeiras ativas e por fazer; concluídas ficam numa secção recolhível no final.",
        "Separadores do dashboard agora aparecem 2 por linha no telemóvel para melhor visualização.",
        "Secção 'Sobre a app' com manual de utilização integrado para novos utilizadores.",
        "Corrigida sincronização cloud entre dispositivos."
      ]
    },
    {
      "version": "0.1.7",
      "date": "2026-02-14",
      "changes": [
        "Novo Plano de Estudos: visão geral do curso por ano/semestre com barra de progresso.",
        "Novo Plano de Estudo Pessoal: organiza semanas de estudo com kanban (Por fazer, Em progresso, Feito).",
        "Exportação .ics do plano pessoal para Google Calendar, Outlook, Apple Calendar.",
        "Nova entrada 'Plano' na barra de navegação."
      ]
    },
    {
      "version": "0.1.6",
      "date": "2026-02-14",
      "changes": [
        "Corrigido carregamento de cadeiras: agora carrega apenas as cadeiras do curso selecionado (antes acumulava de vários cursos).",
        "LEI unificada numa só opção (sem plano 3/5 anos separado).",
        "Notificação de novidades agora aparece corretamente ao abrir a app."
      ]
    },
    {
      "version": "0.1.5",
      "date": "2026-02-14",
      "changes": [
        "Corrigido botão 'Carregar cadeiras' que não funcionava corretamente.",
        "E-fólios e g-fólio são agora criados automaticamente ao ativar uma cadeira.",
        "Exame renomeado de 'p-fólio' para 'g-fólio' (nomenclatura atual da UAb).",
        "Fonte dos dados corrigida: Guia dos Cursos UAb (não wiki)."
      ]
    },
    {
      "version": "0.1.4",
      "date": "2026-02-14",
      "changes": [
        "Base de dados completa com todas as 12 licenciaturas da UAb e respetivas cadeiras.",
        "Todas as licenciaturas suportam carregamento automático do plano de estudos."
      ]
    },
    {
      "version": "0.1.3",
      "date": "2026-02-13",
      "changes": [
        "Corrigida a sincronização cloud.",
        "Criação de conta e login operacionais."
      ]
    }
  ]
}
